var question=document.getElementById('qst');
var answer=document.getElementById('ans');
var write=document.getElementById('number');
var valide=0;
function suivant (){

	if (write.value=="") {
		alert("أجب أيها الزنجي الديوث")
	}
	else {
		valide++;
	}
	
	if (valide==1) {
		question.innerHTML=
		'أنت كتسوق و هاز معاك 8 ديال الركاب فحالة سكر ، بسرعة 120كم/الميكروثانية .. '+ 
		'<br>' +'و قدامك فيراج 90 درجة و حافة كتأدي لمنحدر العمق ديالو 5 كيلومتر.. في نفس اللحظة '+ 
		'<br>' +' العجلة الخلفية ديال الدراجة الهوائية ديالك كتحيد.. و عندك 0.00001 ثانية باش تقرر.';

		answer.innerHTML=
		'1ـ نشعل أضواء التقابل و نطفي الهاتف ديالي'+ 
		'<br>' +'<br>' +
		'2ـ نطفي أضواء التقابل و نشعل الهاتف ديالي'+ '<br>' + '<br>' +
		'3ـ نرجع الصرف للركاب لي خلصوني قبل 3 ساعات';
	}

		
	if (valide==2) {
		question.innerHTML=
		'أنا يلاه خارج من الكاراج.. و على اليمين ديالي عقبة .. و على اليسار باراج ديال الشرطة..'+
		'<br>' +'و دماء الجثة ديال المهاجر الإفريقي لي قطعت على شكل صوت ديال أجراس الكنيسة،'+ 
		'<br>' +'كتسيل من الباب الخلفي ديال السيارة ديالي.. و أمامي طائرة مسافرين كتحاول دير هبوط '+ 
		'<br>' +' اضطراري على بعد 2 سنتمتر من العجلة الخلفية ديال السيارة.. '+ 
		'<br>' +' و كنتفكر القنبلة لي كان كيلعب بيها ولدي و نساها في المقعد الخلفي '+ 
		'<br>' +' و لي فيها 100 ميڭاطون من المتفجرات..بلي غادي تنفجر بعد '+ 
		'<br>' +' (مليار أصفار 9 ),0 ثانية..';


		answer.innerHTML=
		'1ـ نزل نتأكد من ضغط العجلة الإحتياطية ديال السيارة لي أصلا معنديش'+ 
		'<br>' +'<br>' +
		'2ـ نوجه التحية لملك البلاد بصوت مرتفع باش نتفادى الشرطة'+ '<br>' +
		 '<br>' +'3ـ نزيد السرعة باستمرار باش نزيد نخلع السيدة لي راكبة في الطائرة'+
		 '<br>' + ' و كتشوف فيا جاي بالسيارة ديالي نحو النافذة ديالها';


	}
	if (valide==3) {
		question.innerHTML=
		'على الطريق السيار كيرن الهاتف ديالك.. و كتشوف أمامك واحد إبن زنا المحارم'+ 
		'<br>' +' كيحاول يقطع للجهة الأخرى و هو كيقلد مشية "الرجل النائم الذي لا يملك أرجل"..'+ 
		'<br>' +'و كيوقع عطب في التروطينيت ديالك و كتزاد السرعة ديالك ل 600 كم/س..'+ 
		'<br>' +'لكن لحسن الحظ كتلاحظ أنك داير حزام السلامة.. (سؤال إجباري لاجتياز الامتحان)';

		answer.innerHTML='1ـ تسبو!'+ 
		'<br>' +'<br>' +
		'2ـ تسب ليه واليديه!'+ '<br>' + '<br>' +'3ـ تشعل أضواء الوضع الخلفية باش تنبه السائق لي قدامك '+ '<br>' + 'بأن هتلر لم يفعل أي شيء خطأ';


	}
		if (valide==4) {
		question.innerHTML=
		'في يوم مشمس جدا ..و أنت في طريق وطنية كتلاحظ دوبان الزجاج ديال السيارة'+ 
		'<br>' +' و في المقعد الخلفي كاين رجل مافيا غادي يضغط الزناد بعد 0.000002 ثانية '+ 
		'<br>' +' و هو موجه المسدس نحو أحد علماء الناسا لي كيبعد عليه 6000 كيلومتر..'+ 
		'<br>' +' فجأة تكتشف أن الأرض مسطحة و تحاول إخبار إبنك الذي انتحر قبل أن يولد..'+ 
		'<br>' +' فتصاب بالإكتئاب و توجه السيارة نحو رجل المافيا في المقعد الخلفي..'+ 
		'<br>' +' قبل ماضربو ب 2 ثواني كتلقى ملتقى طرق كبيرا فصغيرا في قصيرا في طويلا..';

		answer.innerHTML='1ـ نشد ليمن .. و نسوق بليسر! (مع العلم أنني معاق و اليد اليمنى ديالي مقطوعة)'+ 
		'<br>' +'<br>' +
		'2ـ نعطي حق الأسبقية للشاحنة لي دازت حدايا قبل 4 سنوات'+ '<br>' + 
		'<br>' +'3ـ ناخد حق الأسبقية و نوقف باش تاحد ميدوز'+ '<br>' +
		'(مع العلم أن هاد الطريق مداز منها تا حد منذ 4 سنوات)';


	}
			if (valide==5) {
		question.innerHTML=
		'في يوم عطلة ..أنا مسافر بالعائلة ديالي لأحد المدن المغربية السياحية الجميلة.. '+ 
		'<br>' +' (جرف الملحة)  بجهة إشراردة بني حسين.. و بعد 6 ساعات ديال المستمرة دون أكل كنحس '+ 
		'<br>' +' بلي أنا لا أستحق أن أعيش هذه الحياة السعيدة.. ثم أتذكر إسم المدينة لي'+ 
		'<br>' +' أنا متوجه لها.. فكيرجع كلشي على ما يرام لأن الإكتئاب كيرجع لأعلى'+ 
		'<br>' +' المستويات.. و فجأة كنسمع صوت "بسكخهشعرزملكنبسج" في المحرك!'+ 
		'<br>' +' و إبني الرضيع كيسقط من النافذة الخلفية قبل 5ساعات و 59 دقيقة ';

		answer.innerHTML='1ـ نبه بالمنبه الصوتي (لي هو السب و القذف و الشتم) الزوجة ديالي للرضيع '+ 
		'<br>' +'<br>' +
		'2ـ نبه بالمنبه الصوتي السائقين لي قراب ليا بلي حياتي مجرد غلطة'+ '<br>' + 
		'<br>' +'3ـ نستعد للموقوف .. و ندوز مع احترام حق الأسبقية للراجلين';


	}
			if (valide==6) {
		question.innerHTML=
		'كنسوق داخل المدينة ليلا..فجأة أرى إبن زواج المتعة يحاول قطع الشارع من الممر الخاص'+ 
		'<br>' +' بالراجلين.. و هو يزحف على يديه و يبدو أن رجليه مقطوعتان فقط بعد 10 ثواني من مروري '+ 
		'<br>' +' فوقه..و الإشارة الضوئية أقحاونية.. ';

		answer.innerHTML=
		'1ـ نحتارم قانون السير و نعطي حق الأسبقية للراجلين..لكن إبن زواج المتعة يزحف على '+ 
		'<br>' +'يديه و رجليه مقطوعتان.. إذا نعطي حق الأسبقية للراجلين و ندوز مع زيادة السرعة'+ 
		'<br>' +'<br>' +
		'2ـ نبهو بالمنبه الصوتي (لي هو رمي 10 كيلوغرامات من الليتيوم المذاب على رأسه) و ندوز'+ '<br>' +
		'<br>' +'3ـ نتوقف..(بعد المسافة لي كتفصلني على أن العجلة الخلفية تكون فوق رأس إبن زواج المتعة)';


	}
			if (valide==7) {
		question.innerHTML=
		'أنا سائق سيارة أجرة..و هاز 9 البلايص .. بعد قصة طويلة كنلقى راسي في العصر  '+ 
		'<br>' +'الحجري.. و أحد الركاب يقول (غير شي بلاصة هنا باراكة عليك).. و مؤشر الوقود'+ 
		'<br>' +'يشير لناقص 10 لترات.. ثم الراكب كيقول (سمح لي نسيت,واش عندك صرف 2.000.500درهم)'+ 
		'<br>' +'علما أن ثمن الرحلة 6.93435435 سنتيم.. ';

		answer.innerHTML=
		'1ـ نشعل أضواء التقابل و الضباب و الوضع و نروم لليمين '+ 
		'<br>' +'<br>' +
		'2ـ نخترع آلة زمنية و نرجع لطفولة الراكب لي بغا ينزل و نقوليه ولي سائق سيارة أجرة'+ '<br>'
		 + 'و نزيد بالزمن فين كان باش نكون أنا لي باغي ينزل و معنديش الصرف ديال 2.000.500درهم'+ '<br>' 
		 +'و هو السائق لي معندوش الصرف..'+ 
		'<br>' +'<br>'+ '3ـ نبه الراكب بالمنبه الصوتي (لي هو السب و الشتم)بلي حنا فعصر لا تساوي فيه النقود شيئا';


	}
			if (valide==8) {
document.getElementById("end").style.visibility='visible';


	}
}
